# ResList_RemRsrcCtrls

## Description
Removes all resource controls previously added to the top bar of a resource popup. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_RemRsrcCtrls(uniqueID : STRING);
```

```python

def vs.ResList_RemRsrcCtrls(uniqueID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||

## Version
Availability: from Vectorworks 2024.4
## Category
* Document List Handling